[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:85:35
           id="station"
           type="text"
           isInvalid={Boolean(errors.station)}
-          {...register("station", {
-            required: "Station is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters.",
-            },
-          })}
+          {...register("station", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on bad input
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<div class="invalid-feedback">Max length 30 characters.</div>]
