[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:15:18
 export default function UCSBDiningCommonsMenuItemTable({
   menuItems,
   currentUser,
-  testIdPrefix = "UCSBDiningCommonsMenuItemTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbDiningCommonsMenuItem/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbDiningCommonsMenuItem/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:37:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-
-    {
-      Header: "Dining Commons",
-      accessor: "diningCommonsCode",
-    },
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
