[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:25:24
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
   // Stryker restore Regex
 
-  const testIdPrefix = "HelpRequestForm";
+  const testIdPrefix = "";
 
   return (
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:62:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="teamId">Team Id</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-teamId"}
+          data-testid={testIdPrefix + ""}
           id="teamId"
           type="text"
killedBy: HelpRequestForm tests No Error messages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:66:34
           id="teamId"
           type="text"
           isInvalid={Boolean(errors.teamId)}
-          {...register("teamId", {
-            required: "TeamId is required.",
-          })}
+          {...register("teamId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /TeamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:80:39
           Table Or Breakout Room
         </Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-tableOrBreakoutRoom"}
+          data-testid={testIdPrefix + ""}
           id="tableOrBreakoutRoom"
           type="text"
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/HelpRequest/HelpRequestForm.js:86:34
           isInvalid={Boolean(errors.tableOrBreakoutRoom)}
           {...register("tableOrBreakoutRoom", {
             required: "Table Or Breakout Room is required.",
-            validate: (value) => {
-              const normalizedValue = value.trim().toLowerCase();
-              return (
-                normalizedValue === "table" ||
-                normalizedValue === "breakoutroom" ||
-                "Value must be 'table' or 'breakoutroom'."
-              );
-            },
+            validate: (value) => {},
           })}
         />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Value must be 'table' or 'breakoutroom'./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/HelpRequest/HelpRequestForm.js:87:39
           {...register("tableOrBreakoutRoom", {
             required: "Table Or Breakout Room is required.",
             validate: (value) => {
-              const normalizedValue = value.trim().toLowerCase();
+              const normalizedValue = value.trim().toUpperCase();
               return (
                 normalizedValue === "table" ||
killedBy: HelpRequestForm tests No Error messages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] MethodExpression
main/components/HelpRequest/HelpRequestForm.js:87:39
           {...register("tableOrBreakoutRoom", {
             required: "Table Or Breakout Room is required.",
             validate: (value) => {
-              const normalizedValue = value.trim().toLowerCase();
+              const normalizedValue = value.toLowerCase();
               return (
                 normalizedValue === "table" ||
killedBy: HelpRequestForm tests Validation for tableOrBreakoutRoom with input ' table '
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:89:17
             validate: (value) => {
               const normalizedValue = value.trim().toLowerCase();
               return (
-                normalizedValue === "table" ||
-                normalizedValue === "breakoutroom" ||
-                "Value must be 'table' or 'breakoutroom'."
+                (normalizedValue === "table" || normalizedValue === "breakoutroom") && "Value must be 'table' or 'breakoutroom'."
               );
             },
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Value must be 'table' or 'breakoutroom'./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:89:17
             validate: (value) => {
               const normalizedValue = value.trim().toLowerCase();
               return (
-                normalizedValue === "table" ||
+                normalizedValue !== "table" ||
                 normalizedValue === "breakoutroom" ||
                 "Value must be 'table' or 'breakoutroom'."
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Value must be 'table' or 'breakoutroom'./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:90:17
               const normalizedValue = value.trim().toLowerCase();
               return (
                 normalizedValue === "table" ||
-                normalizedValue === "breakoutroom" ||
+                normalizedValue !== "breakoutroom" ||
                 "Value must be 'table' or 'breakoutroom'."
               );
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Value must be 'table' or 'breakoutroom'./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:90:17
               const normalizedValue = value.trim().toLowerCase();
               return (
                 normalizedValue === "table" ||
-                normalizedValue === "breakoutroom" ||
+                false ||
                 "Value must be 'table' or 'breakoutroom'."
               );
killedBy: HelpRequestForm tests Validation for tableOrBreakoutRoom with input 'breakoutroom'
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:142:39
         <Form.Label htmlFor="solved">Solved</Form.Label>
 
         <Form.Check
-          data-testid={testIdPrefix + "-solved"}
+          data-testid={testIdPrefix + ""}
           type="checkbox"
           id="solved"
killedBy: HelpRequestForm tests No Error messages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
