[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:66:13
     {
       Header: "Solved",
       accessor: "solved",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
   ];
killedBy: HelpRequest tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:
