[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helprequest) => {
     toast(
-      `New Help Request Created - id: ${helprequest.id} requesterEmail: ${helprequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Help Request Created - id: 5 requesterEmail: awin@ucsb.edu"
Received: ""

Number of calls: 1
