[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:3:61
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBDiningCommonsMenuItemEditPage() {
-  // Stryker disable all : UCSBDiningCommonsMenuItem for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function UCSBDiningCommonsMenuItemEditPage() {}
 
killedBy: PlaceholderEditPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Edit page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
