[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:8:16
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const addZ = (string) => `${string}Z`;
+  const addZ = () => undefined;
   const objectToAxiosParams = (recommendationRequest) => ({
     url: "/api/recommendationrequest/post",
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "dateNeeded": "2025-04-30T06:50:50.000Z",
-   "dateRequested": "2025-04-30T05:50:50.000Z",

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:9:31
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const addZ = (string) => `${string}Z`;
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requestorEmail: recommendationRequest.requestorEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: addZ(recommendationRequest.dateRequested),
-      dateNeeded: addZ(recommendationRequest.dateNeeded),
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:22:48
     },
   });
 
-  const onSuccess = (recommendationrequest) => {
-    toast(
-      `New recommendation request Created - id: ${recommendationrequest.id} requestorEmail: ${recommendationrequest.requestorEmail}`,
-    );
-  };
+  const onSuccess = (recommendationrequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequest
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 2 requestorEmail: kevinlee@ucsb.edu"

Number of calls: 0
